/* button in progress sheet */
"Stop" = "Seis";

/* menu item */
"Update iPod" = "Päivitä iPod";

/* Restore iPod command key */
"R" = "R";

/* menu item */
"Restore iPod" = "Palauta iPod";

/* menu item */
"Close Window" = "Sulje ikkuna";

/* menu item */
"Copy" = "Kopioi";

/* menu item */
"Paste" = "Sijoita";

/* menu item */
"Quit" = "Lopeta";

/* Close Window command key */
"W" = "W";

/* menu title */
"Edit" = "Muokkaus";

/* menu item */
"About iPod Updater" = "Tietoja: iPod Updater";

/* menu item */
"Cut" = "Leikkaa";

/* Cut command key */
"X" = "X";

/* Quit command key */
"Q" = "Q";

/* menu title */
"Options" = "Valinnat";

/* Copy command key */
"C" = "C";

/* Paste command key */
"V" = "V";

/* text next to lock when locked */
"Click the lock to make changes." = "Osoita lukkoa tehdäksesi muutoksia.";

/* Return Character */
"\r" = "\r";

/* text next to lock when unlocking */
"Authenticating..." = "Määritellään...";

/* text next to lock when unlocked */
"Click the lock to prevent further changes." = "Osoita lukkoa estääksesi muutokset.";

/* detail of error message, part in <> is replaced and should not be translated) */
"The Mac OS error code was <error>." = "Mac OS -virhekoodi on <error>.";

/* error message */
"Error updating or restoring iPod. (<error>)" = "Virhe päivitettäessä tai palautettaessa iPodia. (<error>)";

/* error message */
"Could not find updater library." = "Päivittäjäkirjastoa ei löytynyt.";

/* error message */
"The iPod Updater cannot open the library FlashLibrary.bundle." = "iPod Updater ei voi avata kirjastoa FlashLibrary.bundle.";

/* error message */
"An unexpected error occurred." = "Tapahtui odottamaton virhe.";

/* detail of error message */
"The iPod Updater application may be damaged." = "iPod Updater -ohjelma saattaa olla vioittunut.";

/* error message */
"Out of memory." = "Muisti loppu.";

/* error message */
"The iPod Updater requires Mac OS X." = "iPod Updaterin käyttöön vaaditaan Mac OS X.";

/* error message */
"The iPod Updater requires CarbonLib 1.4 or newer." = "iPod Updaterin käyttöön vaaditaan CarbonLib 1.4 tai uudempi.";

/* error message */
"The iPod is not mounted." = "iPod ei ole työpöydällä.";

/* detail of confirmation message */
"If you quit while an operation is in progress, you may need to restore the iPod software later." = "Jos lopetat kun jokin toiminto on kesken, iPod-ohjelmisto on ehkä palautettava myöhemmin.";

/* info window version */
"<version> (up to date)" = "<version> (ei tarvitse päivitystä)";

/* info window label */
"Software Version:" = "Ohjelmistoversio:";

/* about window app version line */
"Version <version>" = "Versio <version>";

/* main window message */
"Your iPod has been updated to version <version>. Please unplug and replug the iPod so it can complete the update process." = "iPod on päivitetty versioon <version>. Irrota iPodin kaapeli ja liitä se sitten uudelleen, jotta päivitys voidaan suorittaa loppuun.";

/* confirmation dialog title */
"Quit " = "Lopeta ";

/* detail of error message */
"Please attach one iPod at a time to be updated." = "Liitä päivitettäväksi vain yksi iPod kerrallaan.";

/* main window message */
"Your iPod has been restored to factory settings. Please unplug and replug the iPod so it can complete the restore process." = "iPod on palautettu tehdasasetuksiin. Irrota sen kaapeli ja liitä se sitten uudelleen, jotta palautus voidaan suorittaa loppuun.";

/* info window label */
"Name:" = "Nimi:";

/* main window message */
"Your iPod has been restored to factory settings. Please eject and then unplug and replug the iPod so it can complete the restore process." = "iPod on palautettu tehdasasetuksiin. Poista iPod työpöydältä, irrota sitten kaapeli ja liitä se uudelleen, jotta palautus voidaan suorittaa loppuun.";

/* message for main window */
"Restore completely erases your iPod and applies factory settings. Your music and other data will be erased." = "Palautus tyhjentää iPodin kokonaan ja palauttaa tehdasasetukset. Musiikki ja tallennetut tiedot poistetaan.";

/* main window message */
"An iPod is attached, but not mounted on the desktop." = "iPod on liitetty, mutta se ei ole työpöydällä.";

/* main window message */
"Your iPod has been updated to version <version>, and is restarting. Please leave the iPod connected and wait while it completes the update process." = "iPod on päivitetty versioon <version>, ja se käynnistyy uudelleen. Anna iPodin olla liitettynä tietokoneeseen ja odota, kunnes palautusprosessi on suoritettu loppuun.";

/* main window message */
"Your iPod has been restored to factory settings, and is restarting. Please leave the iPod connected and wait while it completes the restore process." = "iPod on palautettu tehdasasetuksiin, ja se käynnistyy uudestaan. Anna iPodin olla liitettynä tietokoneeseen ja odota, kunnes palautusprosessi on suoritettu loppuun.";

/* error message */
"More than one iPod is attached." = "Useampi kuin yksi iPod on liitettynä.";

/* button for main window */
"Nothing" = "Ei mitään";

/* error message */
"This iPod requires Mac OS X version 10.2.8." = "Tämä iPod edellyttää Mac OS X versiota 10.2.8.";

/* error message */
"The iPod disk does not have the correct structure. You must restore the iPod." = "iPod-levyn rakenne ei ole kelvollinen.iPodin ohjelmisto on palautettava.";

/* progress message */
"Updating iPod software" = "iPod-ohjelmistoa päivitetään";

/* about window firmware version line */
"iPod Software Version <version>" = "iPod-ohjelmistoversio <version>";

/* progress message */
"Done updating iPod software" = "iPod-ohjelmisto on päivitetty";

/* main window title */
"iPod Windows Software <version> Updater" = "iPodin Windows-ohjelmiston <version> päivittäjä";

/* button for main window */
"Update" = "Päivitä";

/* button for main window */
"Restore" = "Palauta";

/* progress message */
"Done restoring iPod software" = "iPod-ohjelmisto on palautettu";

/* info window label */
"Capacity:" = "Tallennustila:";

/* main window message */
"The attached iPod model is not supported by this application." = "Tämä ohjelma ei tue liitettyä iPod-mallia.";

/* main window message */
"Your iPod has been updated to version <version>. Please eject and then unplug and replug the iPod so it can complete the update process." = "iPod on päivitetty versioon <version>. Poista iPod työpöydältä ja irrota ja liitä sitten uudelleen sen kaapeli, jotta päivitys voidaan suorittaa loppuun.";

/* main window message */
"Update is complete. Please disconnect iPod from computer and connect it to the external power supply to allow firmware reflash." = "Päivitys on suoritettu. Irrota iPod tietokoneesta ja liitä se ulkoiseen virtalähteeseen, jotta firmware ehtii tallentua uudelleen.";

/* progress message */
"Restoring iPod software" = "Palautetaan iPod-ohjelmistoa";

/* message for main window */
"Reset iPod to Windows factory settings. \rAll music and data will be erased." = "Palauta iPod Windowsin tehdasasetuksiin. \rKaikki musiikki ja tiedot poistetaan.";

/* main window message */
"Plug in an iPod to update it." = "Liitä iPod päivitystä varten.";

/* error message */
"An error occurred. There may be open files on the iPod." = "Tapahtui virhe. iPodin tiedostoja saattaa olla avoinna.";

/* error message */
"No iPod is attached." = "Yhtään iPodia ei ole liitetty.";

/* info window capacity */
"MB" = "Mt";

/* message for main window */
"Update puts the latest system software on your iPod." = "Päivitys päivittää iPodiin uusimman käyttöjärjestelmän.";

/* error message */
"The updater does not have a volume image." = "Päivittäjällä ei ole taltiokuvausta.";

/* error message */
"The updater does not have a firmware image." = "Päivittäjällä ei ole firmware-kuvausta.";

/* main window message */
"More than one iPod is attached. Please attach one iPod at a time to be updated." = "Useampi kuin yksi iPod on liitettynä. Liitä päivitettäväksi vain yksi iPod kerrallaan.";

/* info window version */
"<version>" = "<versio>";

/* confirmation dialog title */
"Restore " = "Palauta ";

/* main window title */
"iPod Updater" = "iPod Updater";

/* main window message */
"Your iPod has been updated to version <version>, and must be restarted to complete the update process." = "iPod on päivitetty versioon <version>, ja se on käynnistettävä uudelleen, jotta päivitysprosessi voidaan suorittaa loppuun.";

/* error message */
"Error updating or restoring iPod. [<error>]" = "Päivitettäessä tai palautettaessa iPodia tapahtui virhe. [<error>]";

/* confirmation message */
"Are you sure you want to restore the iPod software?" = "Haluatko varmasti palauttaa iPod-ohjelmiston?";

/* error message */
"Could not find a SysInfo file on the iPod disk." = "iPodin levyltä ei löytynyt SysInfo-tiedostoa.";

/* error message */
"This iPod requires Mac OS X version 10.3.4 or newer." = "Tämä iPod edellyttää Mac OS X versiota 10.3.4 tai uudempaa.";

/* main window message */
"Your iPod has been restored and must be restarted to complete the restore process." = "iPod on palautettu, ja se on käynnistettävä uudestaan palautusprosessin loppuun suorittamista varten.";

/* info window version */
"<version> (needs update)" = "<version> (tarvitsee päivityksen)";

/* detail of confirmation message */
"All data currently stored on the iPod will be lost." = "Kaikki iPodiin tallennetut tiedot häviävät.";

/* info window capacity */
"GB" = "Gt";

/* confirmation message */
"Quit while this operation is in progress?" = "Lopetetaanko toiminnon ollessa kesken?";

/* detail of error message */
"A single iPod was detected, but it must be mounted on the desktop for this operation to work." = "Yksi iPod tunnistettiin, mutta sen on oltava työpöydällä, jotta toiminto voidaan suorittaa.";

/* info window label */
"iPod (Recovery Mode)" = "iPod (Palautustila)";

/* info window label */
"Serial Number:" = "Sarjanumero:";

/* info window label */
"N/A" = "-";

/* main window message */
"The attached iPod does not have proper software on it." = "Liitetyssä iPodissa ei ole oikeaa ohjelmistoa.";

/* error message */
"The iPod could not be unmounted because it is in use. Please close any open files on the iPod and try again." = "iPodia ei voida poistaa työpöydältä, koska se on käytössä. Sulje kaikki iPodin auki olevat tiedostot ja yritä uudelleen.";

/* main window message */
"Initializing..." = "Käynnistetään...";

/* error message */
"An error occurred. This Updater cannot update Windows (FAT) formatted iPods. Try restore or using the Windows Updater." = "Tapahtui virhe. Tämä Updater ei voi päivittää Windows (FAT) -formatoituja iPodeja. Yritä palautusta tai Windows Updaterin käyttöä.";

/* error message */
"Could not obtain authentication." = "Ei voitu autentikoitua.";

/* main window message */
"Restore is complete. Please disconnect iPod from computer and connect it to the external power supply to allow firmware reflash." = "Palautus on suoritettu. Irrota iPod tietokoneesta ja liitä se ulkoiseen virtalähteeseen, jotta firmware ehtii tallentua uudelleen.";

/* about payloads */
"Included Updates:" = "Sisältää seuraavat päivitykset:";
